In [2]:
import numpy as np
import pandas as pd

### Pandas Series

A Pandas `Series` is an **indexed NumPy array**

In [3]:
labels = ['a', 'b', 'c']

In [4]:
mylist = [10, 20, 30]

In [5]:
arr = np.array(mylist)

In [6]:
arr

array([10, 20, 30])

In [7]:
d = {'a': 10, 'b': 20, 'c': 30}

In [22]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=[10, 'a', 3.14])

0      10
1       a
2    3.14
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4], index=['USA','Germany','France','Korea'])

In [13]:
ser1

USA        1
Germany    2
France     3
Korea      4
dtype: int64

In [19]:
ser1['USA']

np.int64(1)

In [20]:
ser2 = pd.Series([1,3,5,4], index=['USA','UK','France','Korea'])

In [21]:
ser1 + ser2

France     8.0
Germany    NaN
Korea      8.0
UK         NaN
USA        2.0
dtype: float64

### Pandas DataFrame

Pandas `DataFrames` are made of series.

In [23]:
np.random.seed(123)
rand_mat = np.random.randn(5,4)

In [24]:
rand_mat

array([[-1.0856306 ,  0.99734545,  0.2829785 , -1.50629471],
       [-0.57860025,  1.65143654, -2.42667924, -0.42891263],
       [ 1.26593626, -0.8667404 , -0.67888615, -0.09470897],
       [ 1.49138963, -0.638902  , -0.44398196, -0.43435128],
       [ 2.20593008,  2.18678609,  1.0040539 ,  0.3861864 ]])

In [30]:
df = pd.DataFrame(data=rand_mat, index='A B C D E'.split(), columns='W X Y Z'.split())

In [31]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [33]:
df['W']

A   -1.085631
B   -0.578600
C    1.265936
D    1.491390
E    2.205930
Name: W, dtype: float64

In [34]:
df.W

A   -1.085631
B   -0.578600
C    1.265936
D    1.491390
E    2.205930
Name: W, dtype: float64

In [36]:
df[['W', 'X']]

          W         X
A -1.085631  0.997345
B -0.578600  1.651437
C  1.265936 -0.866740
D  1.491390 -0.638902
E  2.205930  2.186786

In [37]:
df['New'] = df['W'] + df['Y']

In [38]:
df

          W         X         Y         Z       New
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408
E  2.205930  2.186786  1.004054  0.386186  3.209984

In [39]:
df.drop('New', axis=1) # axis = 0 for row, 1 for column

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [40]:
df # df.drop() is not in place

          W         X         Y         Z       New
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408
E  2.205930  2.186786  1.004054  0.386186  3.209984

In [41]:
df.drop('New', axis=1, inplace=True)

In [42]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [47]:
df.drop('A')

          W         X         Y         Z
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [48]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [49]:
df.loc['A']

W   -1.085631
X    0.997345
Y    0.282978
Z   -1.506295
Name: A, dtype: float64

In [52]:
df.iloc[2]

W    1.265936
X   -0.866740
Y   -0.678886
Z   -0.094709
Name: C, dtype: float64

In [53]:
df.loc[['A','E']]

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
E  2.205930  2.186786  1.004054  0.386186

In [54]:
df.iloc[[0, 2]]

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
C  1.265936 -0.866740 -0.678886 -0.094709

In [56]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.997345  0.282978
B  1.651437 -2.426679

DataFrame conditional selection

In [57]:
df > 0

       W      X      Y      Z
A  False   True   True  False
B  False   True  False  False
C   True  False  False  False
D   True  False  False  False
E   True   True   True   True

In [58]:
df_bool = df > 0

In [59]:
df[df_bool]

          W         X         Y         Z
A       NaN  0.997345  0.282978       NaN
B       NaN  1.651437       NaN       NaN
C  1.265936       NaN       NaN       NaN
D  1.491390       NaN       NaN       NaN
E  2.205930  2.186786  1.004054  0.386186

In [60]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.997345  0.282978       NaN
B       NaN  1.651437       NaN       NaN
C  1.265936       NaN       NaN       NaN
D  1.491390       NaN       NaN       NaN
E  2.205930  2.186786  1.004054  0.386186

In [63]:
df['W'] > 0

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool

In [64]:
df[df['W'] > 0]

          W         X         Y         Z
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [66]:
cond1 = df['W'] > 0
cond2 = df['Y'] < 0

In [71]:
df[cond1 & cond2]

          W         X         Y         Z
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351

In [72]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [73]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.085631  0.997345  0.282978 -1.506295
1     B -0.578600  1.651437 -2.426679 -0.428913
2     C  1.265936 -0.866740 -0.678886 -0.094709
3     D  1.491390 -0.638902 -0.443982 -0.434351
4     E  2.205930  2.186786  1.004054  0.386186

In [74]:
new_ind = 'AA BB CC DD EE'.split()

In [75]:
new_ind

['AA', 'BB', 'CC', 'DD', 'EE']

In [76]:
df['New'] = new_ind

In [77]:
df

          W         X         Y         Z New
A -1.085631  0.997345  0.282978 -1.506295  AA
B -0.578600  1.651437 -2.426679 -0.428913  BB
C  1.265936 -0.866740 -0.678886 -0.094709  CC
D  1.491390 -0.638902 -0.443982 -0.434351  DD
E  2.205930  2.186786  1.004054  0.386186  EE

In [80]:
df.set_index('New', inplace=True)

In [81]:
df

            W         X         Y         Z
New
AA  -1.085631  0.997345  0.282978 -1.506295
BB  -0.578600  1.651437 -2.426679 -0.428913
CC   1.265936 -0.866740 -0.678886 -0.094709
DD   1.491390 -0.638902 -0.443982 -0.434351
EE   2.205930  2.186786  1.004054  0.386186

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, AA to EE
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [83]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [84]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.659805  0.665985 -0.452503 -0.415616
std    1.416830  1.364343  1.285611  0.695697
min   -1.085631 -0.866740 -2.426679 -1.506295
25%   -0.578600 -0.638902 -0.678886 -0.434351
50%    1.265936  0.997345 -0.443982 -0.428913
75%    1.491390  1.651437  0.282978 -0.094709
max    2.205930  2.186786  1.004054  0.386186

In [85]:
ser_w = df['W'] > 0

In [86]:
ser_w.value_counts()

W
True     3
False    2
Name: count, dtype: int64

In [87]:
sum(ser_w)

3

In [88]:
false_values = len(ser_w) - sum(ser_w)

In [89]:
false_values

2

### Basic Operations

In [90]:
data = {
    'Company': ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 300, 125, 434, 235]
}

In [91]:
df = pd.DataFrame(data)

In [92]:
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    300
3  Microsoft  Vanessa    125
4   Facebook     Carl    434
5   Facebook    Sarah    235

In [93]:
df.groupby('Company')

In [99]:
df.groupby('Company').mean(numeric_only=True)

           Sales
Company
Facebook   334.5
Google     160.0
Microsoft  212.5

In [98]:
df.groupby('Company').std(numeric_only=True)

                Sales
Company
Facebook   140.714249
Google      56.568542
Microsoft  123.743687

In [101]:
df.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   334.500000  160.000000  212.500000
      std    140.714249   56.568542  123.743687
      min    235.000000  120.000000  125.000000
      25%    284.750000  140.000000  168.750000
      50%    334.500000  160.000000  212.500000
      75%    384.250000  180.000000  256.250000
      max    434.000000  200.000000  300.000000

### More operations

In [104]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[111,222,333,111],'col3':['abc','def','ghi','jkl']})

In [105]:
df.head()

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   111  jkl

In [107]:
df['col2'].unique()

array([111, 222, 333])

In [108]:
df['col2'].nunique() # len(unique_values)

3

In [109]:
df['col2'].value_counts()

col2
111    2
222    1
333    1
Name: count, dtype: int64

In [111]:
newdf = df[(df['col1'] > 1) & (df['col2'] < 200)]

In [112]:
newdf

   col1  col2 col3
3     4   111  jkl

In [113]:
def f(x):
    return x ** 2 + 2 * x - 3

In [114]:
df['col1'].apply(f)

0     0
1     5
2    12
3    21
Name: col1, dtype: int64

In [115]:
df['f(x)'] = df['col1'].apply(f)

In [116]:
df

   col1  col2 col3  f(x)
0     1   111  abc     0
1     2   222  def     5
2     3   333  ghi    12
3     4   111  jkl    21

In [117]:
del df['f(x)']

In [118]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   111  jkl

In [119]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [120]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [122]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  194.250000
std    1.290994  106.274409
min    1.000000  111.000000
25%    1.750000  111.000000
50%    2.500000  166.500000
75%    3.250000  249.750000
max    4.000000  333.000000

In [127]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3
2     3   333  ghi
1     2   222  def
0     1   111  abc
3     4   111  jkl

### Data Input and Output

In [130]:
df = pd.read_csv('datasets/example.csv')

In [131]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [132]:
newdf = df[['a', 'b']]

In [134]:
# save newdf
newdf.to_csv('datasets/mynew.csv', index=False)

In [140]:
df = pd.read_excel('datasets/Excel_Sample.xlsx', sheet_name='Sheet1')

In [141]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [142]:
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [143]:
df.drop('Unnamed: 0', axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [149]:
html_table = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [150]:
html_table

[                               Bank Name               City          State  \
 0     The First National Bank of Lindsay            Lindsay       Oklahoma
 1  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 2                          Citizens Bank           Sac City           Iowa
 3               Heartland Tri-State Bank            Elkhart         Kansas
 4                    First Republic Bank      San Francisco     California
 5                         Signature Bank           New York       New York
 6                    Silicon Valley Bank        Santa Clara     California
 7                      Almena State Bank             Almena         Kansas
 8             First City Bank of Florida  Fort Walton Beach        Florida
 9                   The First State Bank      Barboursville  West Virginia

     Cert                 Aquiring Institution      Closing Date  \
 0   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 1  27332    Fulton Bank, National Association    April 26, 2024
 2   8758            Iowa Trust & Savings Bank  November 3, 2023
 3  25851               Dream First Bank, N.A.     July 28, 2023
 4  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 5  57053                  Flagstar Bank, N.A.    March 12, 2023
 6  24735  First Citizens Bank & Trust Company    March 10, 2023
 7  15426                          Equity Bank  October 23, 2020
 8  16748            United Fidelity Bank, fsb  October 16, 2020
 9  14361                       MVB Bank, Inc.     April 3, 2020

    Fund  Sort ascending
 0                 10547
 1                 10546
 2                 10545
 3                 10544
 4                 10543
 5                 10540
 6                 10539
 7                 10538
 8                 10537
 9                 10536  ]

In [151]:
df = html_table[0]

In [152]:
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
5,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
6,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
7,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
8,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
9,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536